## :x: Apply Result





<pre><code>Error: Error creating service account: googleapi: Error 409: Service account sa-gke-kyma-integration already exists within project projects/sap-kyma-prow.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;resourceName&#34;: &#34;projects/sap-kyma-prow/serviceAccounts/sa-gke-kyma-integration@sap-kyma-prow.iam.gserviceaccount.com&#34;
  }
]
, alreadyExists

  with google_service_account.sa_gke_kyma_integration,
  on dns-collector.tf line 3, in resource &#34;google_service_account&#34; &#34;sa_gke_kyma_integration&#34;:
   3: resource &#34;google_service_account&#34; &#34;sa_gke_kyma_integration&#34; {
</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
google_service_account.terraform_executor: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com]
google_dns_managed_zone.build_kyma: Refreshing state... [id=projects/sap-kyma-prow/managedZones/build-kyma]
data.google_container_cluster.untrusted_workload_k8s_cluster: Reading...
data.google_container_cluster.prow_k8s_cluster: Reading...
data.google_container_cluster.trusted_workload_k8s_cluster: Reading...
data.google_client_config.gcp: Reading...
data.google_client_config.gcp: Read complete after 0s [id=projects/"sap-kyma-prow"/regions/"europe-west4"/zones/<null>]
google_container_cluster.trusted_workload: Refreshing state... [id=projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow]
data.google_container_cluster.prow_k8s_cluster: Read complete after 0s [id=projects/sap-kyma-prow/locations/europe-west3-a/clusters/prow]
module.prow_gatekeeper.data.kubectl_path_documents.constraint_templates_path["../../../../opa/gatekeeper/constraint-templates/**.yaml"]: Reading...
module.prow_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/prow/**.yaml"]: Reading...
module.prow_gatekeeper.data.kubectl_file_documents.gatekeeper: Reading...
module.prow_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/prow/**.yaml"]: Read complete after 0s [id=5e665b7758004bfcd801b09dd2fa7c23fcca9d46e860397abc2aac2e213deb16]
data.google_container_cluster.untrusted_workload_k8s_cluster: Read complete after 0s [id=projects/sap-kyma-prow/locations/europe-west3/clusters/untrusted-workload-kyma-prow]
module.prow_gatekeeper.data.kubectl_path_documents.constraint_templates_path["../../../../opa/gatekeeper/constraint-templates/**.yaml"]: Read complete after 0s [id=927f68fe2b1bee2bed9ddde896cce2ee56bbf0312119b6937b57278b94152090]
module.prow_gatekeeper.data.kubectl_file_documents.gatekeeper: Read complete after 1s [id=dd3443633a39325c8656d232ea51eb8515040007156fb9e6433fddd5276456b6]
data.google_container_cluster.trusted_workload_k8s_cluster: Read complete after 1s [id=projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow]
module.untrusted_workload_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/untrusted/**.yaml"]: Reading...
module.untrusted_workload_gatekeeper.data.kubectl_path_documents.constraint_templates_path["../../../../opa/gatekeeper/constraint-templates/**.yaml"]: Reading...
module.untrusted_workload_gatekeeper.data.kubectl_file_documents.gatekeeper: Reading...
module.untrusted_workload_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/untrusted/**.yaml"]: Read complete after 0s [id=e3b0c44298fc1c149afbf4c8996fb92427ae41e4649b934ca495991b7852b855]
module.untrusted_workload_gatekeeper.data.kubectl_path_documents.constraint_templates_path["../../../../opa/gatekeeper/constraint-templates/**.yaml"]: Read complete after 0s [id=927f68fe2b1bee2bed9ddde896cce2ee56bbf0312119b6937b57278b94152090]
module.untrusted_workload_gatekeeper.data.kubectl_file_documents.gatekeeper: Read complete after 0s [id=dd3443633a39325c8656d232ea51eb8515040007156fb9e6433fddd5276456b6]
module.prow_gatekeeper.kubectl_manifest.constraint_templates["apiVersion: templates.gatekeeper.sh/v1\nkind: ConstraintTemplate\nmetadata:\n  name: k8spsphostfilesystem\n  annotations:\n    metadata.gatekeeper.sh/title: \"Host Filesystem\"\n    metadata.gatekeeper.sh/version: 1.0.0\n    description: >-\n      Controls usage of the host filesystem. Corresponds to the\n      `allowedHostPaths` field in a PodSecurityPolicy. For more information,\n      see\n      https://kubernetes.io/docs/concepts/policy/pod-security-policy/#volumes-and-file-systems\nspec:\n  crd:\n    spec:\n      names:\n        kind: K8sPSPHostFilesystem\n      validation:\n        # Schema for the `parameters` field\n        openAPIV3Schema:\n          type: object\n          description: >-\n            Controls usage of the host filesystem. Corresponds to the\n            `allowedHostPaths` field in a PodSecurityPolicy. For more information,\n            see\n            https://kubernetes.io/docs/concepts/policy/pod-security-policy/#volumes-and-file-systems\n          properties:\n            allowedHostPaths:\n              type: array\n              description: \"An array of hostpath objects, representing paths and read/write configuration.\"\n              items:\n                type: object\n                properties:\n                  pathPrefix:\n                    type: string\n                    description: \"The path prefix that the host volume must match.\"\n                  readOnly:\n                    type: boolean\n                    description: \"when set to true, any container volumeMounts matching the pathPrefix must include `readOnly: true`.\"\n  targets:\n    - target: admission.k8s.gatekeeper.sh\n      rego: |\n        package k8spsphostfilesystem\n\n        violation[{\"msg\": msg, \"details\": {}}] {\n            volume := input_hostpath_volumes[_]\n            allowedPaths := get_allowed_paths(input)\n            input_hostpath_violation(allowedPaths, volume)\n            msg := sprintf(\"HostPath volume %v is not allowed, pod: %v. Allowed path: %v\", [volume, input.review.object.metadata.name, allowedPaths])\n        }\n\n        input_hostpath_violation(allowedPaths, volume) {\n            # An empty list means all host paths are blocked\n            allowedPaths == []\n        }\n        input_hostpath_violation(allowedPaths, volume) {\n            not input_hostpath_allowed(allowedPaths, volume)\n        }\n\n        get_allowed_paths(arg) = out {\n            not arg.parameters\n            out = []\n        }\n        get_allowed_paths(arg) = out {\n            not arg.parameters.allowedHostPaths\n            out = []\n        }\n        get_allowed_paths(arg) = out {\n            out = arg.parameters.allowedHostPaths\n        }\n\n        input_hostpath_allowed(allowedPaths, volume) {\n            allowedHostPath := allowedPaths[_]\n            path_matches(allowedHostPath.pathPrefix, volume.hostPath.path)\n            not allowedHostPath.readOnly == true\n        }\n\n        input_hostpath_allowed(allowedPaths, volume) {\n            allowedHostPath := allowedPaths[_]\n            path_matches(allowedHostPath.pathPrefix, volume.hostPath.path)\n            allowedHostPath.readOnly\n            not writeable_input_volume_mounts(volume.name)\n        }\n\n        writeable_input_volume_mounts(volume_name) {\n            container := input_containers[_]\n            mount := container.volumeMounts[_]\n            mount.name == volume_name\n            not mount.readOnly\n        }\n\n        # This allows \"/foo\", \"/foo/\", \"/foo/bar\" etc., but\n        # disallows \"/fool\", \"/etc/foo\" etc.\n        path_matches(prefix, path) {\n            a := path_array(prefix)\n            b := path_array(path)\n            prefix_matches(a, b)\n        }\n        path_array(p) = out {\n            p != \"/\"\n            out := split(trim(p, \"/\"), \"/\")\n        }\n        # This handles the special case for \"/\", since\n        # split(trim(\"/\", \"/\"), \"/\") == [\"\"]\n        path_array(\"/\") = []\n\n        prefix_matches(a, b) {\n            count(a) <= count(b)\n            not any_not_equal_upto(a, b, count(a))\n        }\n\n        any_not_equal_upto(a, b, n) {\n            a[i] != b[i]\n            i < n\n        }\n\n        input_hostpath_volumes[v] {\n            v := input.review.object.spec.volumes[_]\n            has_field(v, \"hostPath\")\n        }\n\n        # has_field returns whether an object has a field\n        has_field(object, field) = true {\n            object[field]\n        }\n        input_containers[c] {\n            c := input.review.object.spec.containers[_]\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.initContainers[_]\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.ephemeralContainers[_]\n        }"]: Refreshing state... [id=/apis/templates.gatekeeper.sh/v1/constrainttemplates/k8spsphostfilesystem]
module.untrusted_workload_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/workloads/**.yaml"]: Reading...
module.prow_gatekeeper.kubectl_manifest.constraint_templates["apiVersion: templates.gatekeeper.sh/v1\nkind: ConstraintTemplate\nmetadata:\n  name: k8spspselinuxv2\n  annotations:\n    metadata.gatekeeper.sh/title: \"SELinux V2\"\n    metadata.gatekeeper.sh/version: 1.0.0\n    description: >-\n      Defines an allow-list of seLinuxOptions configurations for pod\n      containers. Corresponds to a PodSecurityPolicy requiring SELinux configs.\n      For more information, see\n      https://kubernetes.io/docs/concepts/policy/pod-security-policy/#selinux\nspec:\n  crd:\n    spec:\n      names:\n        kind: K8sPSPSELinuxV2\n      validation:\n        # Schema for the `parameters` field\n        openAPIV3Schema:\n          type: object\n          description: >-\n            Defines an allow-list of seLinuxOptions configurations for pod\n            containers. Corresponds to a PodSecurityPolicy requiring SELinux configs.\n            For more information, see\n            https://kubernetes.io/docs/concepts/policy/pod-security-policy/#selinux\n          properties:\n            exemptImages:\n              description: >-\n                Any container that uses an image that matches an entry in this list will be excluded\n                from enforcement. Prefix-matching can be signified with `*`. For example: `my-image-*`.\n\n                It is recommended that users use the fully-qualified Docker image name (e.g. start with a domain name)\n                in order to avoid unexpectedly exempting images from an untrusted repository.\n              type: array\n              items:\n                type: string\n            allowedSELinuxOptions:\n              type: array\n              description: \"An allow-list of SELinux options configurations.\"\n              items:\n                type: object\n                description: \"An allowed configuration of SELinux options for a pod container.\"\n                properties:\n                  level:\n                    type: string\n                    description: \"An SELinux level.\"\n                  role:\n                    type: string\n                    description: \"An SELinux role.\"\n                  type:\n                    type: string\n                    description: \"An SELinux type.\"\n                  user:\n                    type: string\n                    description: \"An SELinux user.\"\n  targets:\n    - target: admission.k8s.gatekeeper.sh\n      rego: |\n        package k8spspselinux\n\n        import data.lib.exempt_container.is_exempt\n\n        # Disallow top level custom SELinux options\n        violation[{\"msg\": msg, \"details\": {}}] {\n            has_field(input.review.object.spec.securityContext, \"seLinuxOptions\")\n            not input_seLinuxOptions_allowed(input.review.object.spec.securityContext.seLinuxOptions)\n            msg := sprintf(\"SELinux options is not allowed, pod: %v. Allowed options: %v\", [input.review.object.metadata.name, input.parameters.allowedSELinuxOptions])\n        }\n        # Disallow container level custom SELinux options\n        violation[{\"msg\": msg, \"details\": {}}] {\n            c := input_security_context[_]\n            not is_exempt(c)\n            has_field(c.securityContext, \"seLinuxOptions\")\n            not input_seLinuxOptions_allowed(c.securityContext.seLinuxOptions)\n            msg := sprintf(\"SELinux options is not allowed, pod: %v, container %v. Allowed options: %v\", [input.review.object.metadata.name, c.name, input.parameters.allowedSELinuxOptions])\n        }\n\n        input_seLinuxOptions_allowed(options) {\n            params := input.parameters.allowedSELinuxOptions[_]\n            field_allowed(\"level\", options, params)\n            field_allowed(\"role\", options, params)\n            field_allowed(\"type\", options, params)\n            field_allowed(\"user\", options, params)\n        }\n\n        field_allowed(field, options, params) {\n            params[field] == options[field]\n        }\n        field_allowed(field, options, params) {\n            not has_field(options, field)\n        }\n\n        input_security_context[c] {\n            c := input.review.object.spec.containers[_]\n            has_field(c.securityContext, \"seLinuxOptions\")\n        }\n        input_security_context[c] {\n            c := input.review.object.spec.initContainers[_]\n            has_field(c.securityContext, \"seLinuxOptions\")\n        }\n        input_security_context[c] {\n            c := input.review.object.spec.ephemeralContainers[_]\n            has_field(c.securityContext, \"seLinuxOptions\")\n        }\n\n        # has_field returns whether an object has a field\n        has_field(object, field) = true {\n            object[field]\n        }\n      libs:\n        - |\n          package lib.exempt_container\n\n          is_exempt(container) {\n              exempt_images := object.get(object.get(input, \"parameters\", {}), \"exemptImages\", [])\n              img := container.image\n              exemption := exempt_images[_]\n              _matches_exemption(img, exemption)\n          }\n\n          _matches_exemption(img, exemption) {\n              not endswith(exemption, \"*\")\n              exemption == img\n          }\n\n          _matches_exemption(img, exemption) {\n              endswith(exemption, \"*\")\n              prefix := trim_suffix(exemption, \"*\")\n              startswith(img, prefix)\n          }"]: Refreshing state... [id=/apis/templates.gatekeeper.sh/v1/constrainttemplates/k8spspselinuxv2]
module.prow_gatekeeper.kubectl_manifest.constraint_templates["apiVersion: templates.gatekeeper.sh/v1\nkind: ConstraintTemplate\nmetadata:\n  name: k8spspallowprivilegeescalationcontainer\n  annotations:\n    metadata.gatekeeper.sh/title: \"Allow Privilege Escalation in Container\"\n    metadata.gatekeeper.sh/version: 1.0.0\n    description: >-\n      Controls restricting escalation to root privileges. Corresponds to the\n      `allowPrivilegeEscalation` field in a PodSecurityPolicy. For more\n      information, see\n      https://kubernetes.io/docs/concepts/policy/pod-security-policy/#privilege-escalation\nspec:\n  crd:\n    spec:\n      names:\n        kind: K8sPSPAllowPrivilegeEscalationContainer\n      validation:\n        openAPIV3Schema:\n          type: object\n          description: >-\n            Controls restricting escalation to root privileges. Corresponds to the\n            `allowPrivilegeEscalation` field in a PodSecurityPolicy. For more\n            information, see\n            https://kubernetes.io/docs/concepts/policy/pod-security-policy/#privilege-escalation\n          properties:\n            exemptImages:\n              description: >-\n                Any container that uses an image that matches an entry in this list will be excluded\n                from enforcement. Prefix-matching can be signified with `*`. For example: `my-image-*`.\n\n                It is recommended that users use the fully-qualified Docker image name (e.g. start with a domain name)\n                in order to avoid unexpectedly exempting images from an untrusted repository.\n              type: array\n              items:\n                type: string\n  targets:\n    - target: admission.k8s.gatekeeper.sh\n      rego: |\n        package k8spspallowprivilegeescalationcontainer\n\n        import data.lib.exempt_container.is_exempt\n\n        violation[{\"msg\": msg, \"details\": {}}] {\n            c := input_containers[_]\n            not is_exempt(c)\n            input_allow_privilege_escalation(c)\n            msg := sprintf(\"Privilege escalation container is not allowed: %v\", [c.name])\n        }\n\n        input_allow_privilege_escalation(c) {\n            not has_field(c, \"securityContext\")\n        }\n        input_allow_privilege_escalation(c) {\n            not c.securityContext.allowPrivilegeEscalation == false\n        }\n        input_containers[c] {\n            c := input.review.object.spec.containers[_]\n        }\n        input_containers[c] {\n            c := input.review.object.spec.initContainers[_]\n        }\n        input_containers[c] {\n            c := input.review.object.spec.ephemeralContainers[_]\n        }\n        # has_field returns whether an object has a field\n        has_field(object, field) = true {\n            object[field]\n        }\n      libs:\n        - |\n          package lib.exempt_container\n\n          is_exempt(container) {\n              exempt_images := object.get(object.get(input, \"parameters\", {}), \"exemptImages\", [])\n              img := container.image\n              exemption := exempt_images[_]\n              _matches_exemption(img, exemption)\n          }\n\n          _matches_exemption(img, exemption) {\n              not endswith(exemption, \"*\")\n              exemption == img\n          }\n\n          _matches_exemption(img, exemption) {\n              endswith(exemption, \"*\")\n              prefix := trim_suffix(exemption, \"*\")\n              startswith(img, prefix)\n          }"]: Refreshing state... [id=/apis/templates.gatekeeper.sh/v1/constrainttemplates/k8spspallowprivilegeescalationcontainer]
module.prow_gatekeeper.kubectl_manifest.constraint_templates["apiVersion: templates.gatekeeper.sh/v1\nkind: ConstraintTemplate\nmetadata:\n  name: k8spspallowedusers\n  annotations:\n    metadata.gatekeeper.sh/title: \"Allowed Users\"\n    metadata.gatekeeper.sh/version: 1.0.0\n    description: >-\n      Controls the user and group IDs of the container and some volumes.\n      Corresponds to the `runAsUser`, `runAsGroup`, `supplementalGroups`, and\n      `fsGroup` fields in a PodSecurityPolicy. For more information, see\n      https://kubernetes.io/docs/concepts/policy/pod-security-policy/#users-and-groups\nspec:\n  crd:\n    spec:\n      names:\n        kind: K8sPSPAllowedUsers\n      validation:\n        openAPIV3Schema:\n          type: object\n          description: >-\n            Controls the user and group IDs of the container and some volumes.\n            Corresponds to the `runAsUser`, `runAsGroup`, `supplementalGroups`, and\n            `fsGroup` fields in a PodSecurityPolicy. For more information, see\n            https://kubernetes.io/docs/concepts/policy/pod-security-policy/#users-and-groups\n          properties:\n            exemptImages:\n              description: >-\n                Any container that uses an image that matches an entry in this list will be excluded\n                from enforcement. Prefix-matching can be signified with `*`. For example: `my-image-*`.\n\n                It is recommended that users use the fully-qualified Docker image name (e.g. start with a domain name)\n                in order to avoid unexpectedly exempting images from an untrusted repository.\n              type: array\n              items:\n                type: string\n            runAsUser:\n              type: object\n              description: \"Controls which user ID values are allowed in a Pod or container-level SecurityContext.\"\n              properties:\n                rule:\n                  type: string\n                  description: \"A strategy for applying the runAsUser restriction.\"\n                  enum:\n                    - MustRunAs\n                    - MustRunAsNonRoot\n                    - RunAsAny\n                ranges:\n                  ty

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

LL_BASE_SHA apply\\n-- terraform -chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner apply -input=false\\n-auto-approve; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # pull-secrets-rotator-tf-plan\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/development\\/secrets-rotator\\/terraform\\/environments\\/prod init -input=false\\n\\\\u0026\\\\u0026 \\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -pr \\$PULL_NUMBER\\n-sha \\$PULL_PULL_SHA plan -- terraform -chdir=\\.\\/development\\/secrets-rotator\\/terraform\\/environments\\/prod\\nplan -input=false -var-file=\\.\\/terraform\\.tfvars; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # jobname\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/configs\\/terraform\\/environments\\/prod init -input=false \\\\u0026\\\\u0026\\n\\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -sha \\$PULL_BASE_SHA apply\\n-- terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod apply -input=false\\n-auto-approve  -var-file=\\.\\/terraform\\.tfvars; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # pull-plan-prod-terraform\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod init -input=false \\\\u0026\\\\u0026 \\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -pr \\$PULL_NUMBER -sha \\$PULL_PULL_SHA plan -- terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod plan -input=false\\ -no-color; \\/ghcomment\\/github-comment hide --org \\$\\(REPO_OWNER\\) --repo \\$\\(REPO_NAME\\) -pr \\$\\(PULL_NUMBER\\) -sha1 \\$\\(PULL_PULL_SHA\\)\\\"\\],\"container_name\":\"test\",.*$'\n      # post-apply-prod-terraform\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod init -input=false \\\\u0026\\\\u0026 \\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -sha \\$PULL_BASE_SHA apply -- terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod apply -input=false -no-color -auto-approve; \\/ghcomment\\/github-comment hide --org \\$\\(REPO_OWNER\\) --repo \\$\\(REPO_NAME\\) -sha1 \\$\\(PULL_BASE_SHA\\)\"\\],\"container_name\":\"test\",.*$'\n      # sidecar\n      - image: \"gcr.io/k8s-prow/sidecar:*\"\n        command: []\n        args: []"]: Refreshing state... [id=/apis/constraints.gatekeeper.sh/v1beta1/secrettrustedusages/kyma-bot-github-token]
module.trusted_workload_gatekeeper.kubectl_manifest.constraints["apiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sPSPAllowPrivilegeEscalationContainer\nmetadata:\n  name: psp-allow-privilege-escalation-container\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"default\"\n  parameters:\n    exemptImages:\n      - gcr.io/k8s-prow/entrypoint:*\n      - gcr.io/k8s-prow/initupload:*\n      - gcr.io/k8s-prow/clonerefs:*\n      - gcr.io/k8s-prow/sidecar:*\n      - \"aquasec/trivy:*\"\n      - \"eu.gcr.io/kyma-project/prow/cleaner:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/bootstrap:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/buildpack-golang:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/gardener-rotate:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/golangci-lint:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev/image-builder:*\"\n      - \"europe-docker.pkg.dev/kyma-project/prod/testimages/e2e-dind-k3d:*\"\n      - \"europe-docker.pkg.dev/kyma-project/prod/testimages/e2e-dind-nodejs:*\"\n      - \"europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*\"\n      - \"gcr.io/k8s-prow/generic-autobumper:*\"\n      - \"gcr.io/k8s-prow/ghproxy:*\""]: Refreshing state... [id=/apis/constraints.gatekeeper.sh/v1beta1/k8spspallowprivilegeescalationcontainers/psp-allow-privilege-escalation-container]
module.trusted_workload_gatekeeper.kubectl_manifest.constraints["apiVersion: constraints.gatekeeper.sh/v1beta1\nkind: SecretTrustedUsage\nmetadata:\n  name: kyma-bot-github-sap-token\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n  parameters:\n    restrictedSecrets:\n      - kyma-bot-github-sap-token\n    trustedImages:\n      # Prowjob name: pre-main-check-users-map\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":\\[\"usersmapchecker\"\\],\"container_name\":\"test\",.*}$'\n      # Prowjob name: github-issues\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/github-issues\\.sh\"\\],\"container_name\":\"test\",.*}$'"]: Refreshing state... [id=/apis/constraints.gatekeeper.sh/v1beta1/secrettrustedusages/kyma-bot-github-sap-token]
module.trusted_workload_gatekeeper.kubectl_manifest.constraints["# Constraint to allow only image-builder tool trusted usage on tekton cluster run as image-builder service account identity.\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: SecretTrustedUsage\nmetadata:\n  name: pjtester-kubeconfig\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n  parameters:\n    restrictedSecrets:\n      - pjtester-kubeconfig\n      - pjtester-github-oauth-token\n    trustedImages:\n      # postsubmit prowjob\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":\\[\"pjtester\",\"--github-token-path=\\/etc\\/github\\/oauth\"\\],\"container_name\":\"test\",.*}$'\n      # sidecar\n      - image: \"gcr.io/k8s-prow/sidecar:*\"\n        command: []\n        args: []"]: Refreshing state... [id=/apis/constraints.gatekeeper.sh/v1beta1/secrettrustedusages/pjtester-kubeconfig]
module.trusted_workload_gatekeeper.kubectl_manifest.constraints["apiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sPSPAllowedUsers\nmetadata:\n  name: psp-pods-allowed-user-ranges\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"default\"\n  # we're not using any users option in prowjobs"]: Refreshing state... [id=/apis/constraints.gatekeeper.sh/v1beta1/k8spspalloweduserses/psp-pods-allowed-user-ranges]
module.trusted_workload_gatekeeper.kubectl_manifest.constraints["apiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sPSPSeccomp\nmetadata:\n  name: psp-seccomp\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"default\"\n  parameters:\n    allowedProfiles:\n      - runtime/default\n      - docker/default\n    exemptImages:\n      - gcr.io/k8s-prow/entrypoint:*\n      - gcr.io/k8s-prow/initupload:*\n      - gcr.io/k8s-prow/clonerefs:*\n      - gcr.io/k8s-prow/sidecar:*\n      - \"aquasec/trivy:*\"\n      - \"eu.gcr.io/kyma-project/prow/cleaner:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/bootstrap:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/buildpack-golang:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/gardener-rotate:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/golangci-lint:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev/image-builder:*\"\n      - \"europe-docker.pkg.dev/kyma-project/prod/testimages/e2e-dind-k3d:*\"\n      - \"europe-docker.pkg.dev/kyma-project/prod/testimages/e2e-dind-nodejs:*\"\n      - \"europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*\"\n      - \"gcr.io/k8s-prow/generic-autobumper:*\"\n      - \"gcr.io/k8s-prow/ghproxy:*\""]: Refreshing state... [id=/apis/constraints.gatekeeper.sh/v1beta1/k8spspseccomps/psp-seccomp]
module.trusted_workload_gatekeeper.kubectl_manifest.constraints["apiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sPSPHostFilesystem\nmetadata:\n  name: psp-host-filesystem\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"default\"\n  parameters:\n    allowedHostPaths:\n      - pathPrefix: \"/lib/modules\"\n      - pathPrefix: \"/sys/fs/cgroup\""]: Refreshing state... [id=/apis/constraints.gatekeeper.sh/v1beta1/k8spsphostfilesystems/psp-host-filesystem]
module.trusted_workload_gatekeeper.kubectl_manifest.constraints["apiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sPSPHostNetworkingPorts\nmetadata:\n  name: psp-host-network-ports\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"default\"\n  # we're not using any hostNetwork option in prowjobs"]: Refreshing state... [id=/apis/constraints.gatekeeper.sh/v1beta1/k8spsphostnetworkingportses/psp-host-network-ports]
module.trusted_workload_gatekeeper.kubectl_manifest.constraints["apiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sPSPHostNamespace\nmetadata:\n  name: psp-host-namespace\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"default\""]: Refreshing state... [id=/apis/constraints.gatekeeper.sh/v1beta1/k8spsphostnamespaces/psp-host-namespace]
module.trusted_workload_gatekeeper.kubectl_manifest.constraints["# Constraint to allow only image-builder tool trusted usage on tekton cluster run as image-builder service account identity.\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: ServiceAccountTrustedUsage\nmetadata:\n  name: terraform-executor\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n  parameters:\n    restrictedServiceAccounts:\n      - terraform-executor\n    trustedImages:\n      # postsubmit prowjob environment prod root module\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod init -input=false \\\\u0026\\\\u0026 \\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -sha \\$PULL_BASE_SHA apply -- terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod apply -input=false -no-color -auto-approve; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*}$'\n      # presubmit prowjob environment prod root module\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod init -input=false \\\\u0026\\\\u0026 \\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -pr \\$PULL_NUMBER -sha \\$PULL_PULL_SHA plan -- terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod plan -input=false -no-color; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*}$'\n      # presubmit prowjob environment prod secrets-rotator module\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform -chdir=\\.\\/development\\/secrets-rotator\\/terraform\\/environments\\/prod init -input=false \\\\u0026\\\\u0026 \\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -pr \\$PULL_NUMBER -sha \\$PULL_PULL_SHA plan -- terraform -chdir=\\.\\/development\\/secrets-rotator\\/terraform\\/environments\\/prod plan -input=false -no-color; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*}$'\n      # postsubmit prowjob environment prod secrets-rotator module\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform -chdir=\\.\\/development\\/secrets-rotator\\/terraform\\/environments\\/prod init -input=false \\\\u0026\\\\u0026 \\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -sha \\$PULL_PULL_SHA apply -- terraform -chdir=\\.\\/development\\/secrets-rotator\\/terraform\\/environments\\/prod apply -input=false -no-color -auto-approve; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*}$'\n      # presubmit prowjob environment prod secret-leak-log-scanner module\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform -chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner init -input=false \\\\u0026\\\\u0026 \\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -pr \\$PULL_NUMBER -sha \\$PULL_PULL_SHA plan -- terraform -chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner plan -input=false -no-color; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*}$'\n      # postsubmit prowjob environment prod secret-leak-log-scanner module\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform -chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner init -input=false \\\\u0026\\\\u0026 \\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -sha \\$PULL_PULL_SHA apply -- terraform -chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner apply -input=false -no-color -auto-approve; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*}$'\n      # prow decoration\n      - image: \"gcr.io/k8s-prow/sidecar:*\"\n        command: []\n        args: []\n      - image: \"gcr.io/k8s-prow/clonerefs:*\"\n        command: []\n        args: []\n      - image: \"gcr.io/k8s-prow/initupload:*\"\n        command: []\n        args: []\n      - image: \"gcr.io/k8s-prow/entrypoint:*\"\n        command: []\n        args: []"]: Refreshing state... [id=/apis/constraints.gatekeeper.sh/v1beta1/serviceaccounttrustedusages/terraform-executor]
module.trusted_workload_gatekeeper.kubectl_manifest.constraints["apiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sPSPCapabilities\nmetadata:\n  name: capabilities\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"default\"\n  # we're not using capabilities"]: Refreshing state... [id=/apis/constraints.gatekeeper.sh/v1beta1/k8spspcapabilitieses/capabilities]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_project_iam_binding.dns_collector_bucket_get will be created
  + resource "google_project_iam_binding" "dns_collector_bucket_get" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = "sap-kyma-prow"
      + role    = "projects/sap-kyma-prow/roles/BucketGet"
    }

  # google_project_iam_binding.dns_collector_container_analysis_occurrences_viewer will be created
  + resource "google_project_iam_binding" "dns_collector_container_analysis_occurrences_viewer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = "sap-kyma-prow"
      + role    = "roles/containeranalysis.occurrences.viewer"
    }

  # google_project_iam_binding.dns_collector_dns_reader will be created
  + resource "google_project_iam_binding" "dns_collector_dns_reader" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = "sap-kyma-prow"
      + role    = "roles/dns.reader"
    }

  # google_service_account.sa_gke_kyma_integration will be created
  + resource "google_service_account" "sa_gke_kyma_integration" {
      + account_id   = "sa-gke-kyma-integration"
      + description  = "Service account is used by Prow to integrate with GKE."
      + disabled     = false
      + display_name = "sa-gke-kyma-integration"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
google_service_account.sa_gke_kyma_integration: Creating...

Warning: "default_secret_name" is no longer applicable for Kubernetes v1.24.0 and above

  with kubernetes_service_account.trusted_workload_terraform_executor,
  on terraform-executor.tf line 42, in resource "kubernetes_service_account" "trusted_workload_terraform_executor":
  42: resource "kubernetes_service_account" "trusted_workload_terraform_executor" {

Starting from version 1.24.0 Kubernetes does not automatically generate a
token for service accounts, in this case, "default_secret_name" will be empty

(and one more similar warning elsewhere)

Error: Error creating service account: googleapi: Error 409: Service account sa-gke-kyma-integration already exists within project projects/sap-kyma-prow.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "resourceName": "projects/sap-kyma-prow/serviceAccounts/sa-gke-kyma-integration@sap-kyma-prow.iam.gserviceaccount.com"
  }
]
, alreadyExists

  with google_service_account.sa_gke_kyma_integration,
  on dns-collector.tf line 3, in resource "google_service_account" "sa_gke_kyma_integration":
   3: resource "google_service_account" "sa_gke_kyma_integration" {


```

</details>

`

<!-- github-comment: {"Command":"apply","PRNumber":8227,"Program":"tfcmt","SHA1":"9f03b5513984b47fcb7ddb553bf836f4fdbb315a","Vars":{}} -->